rossko_mock_response = [
    ((90305610, 'LT-1150'), 'Rossko', '27.12.2023 13:49:35', 'Биробиджан г, Еврейская Аобл, Комбайностроителей, 38 к 3, Автосервис ЕВРОТЕХ', 'Фильтр АКПП', 'LYNXauto', '3062.00', 1, 2),
    ((90290585, '1520831U0B'), 'Rossko', '27.12.2023 11:13:03', 'Биробиджан г, Еврейская Аобл, Комбайностроителей, 38 к 3, Автосервис ЕВРОТЕХ', 'Фильтр масляный', 'Nissan', '631.08', 1, 2),
    ((90284425, 'SI-1061'), 'Rossko', '27.12.2023 07:46:06', 'Биробиджан г, Еврейская Аобл, Комбайностроителей, 38 к 3, Автосервис ЕВРОТЕХ', 'Рычаг подвески | зад прав |', 'SUFIX', '2015.00', 1, 2),
    ((90284425, 'C8592'), 'Rossko', '27.12.2023 07:46:06', 'Биробиджан г, Еврейская Аобл, Комбайностроителей, 38 к 3, Автосервис ЕВРОТЕХ', 'Втулка стабилизатора | перед лев |', 'LYNXauto', '353.00', 1, 2),
    ((90284425, 'C7293LR'), 'Rossko', '27.12.2023 07:46:06', 'Биробиджан г, Еврейская Аобл, Комбайностроителей, 38 к 3, Автосервис ЕВРОТЕХ', 'Стойка стабилизатора | перед прав/лев |', 'LYNXauto', '799.00', 2, 2),
    ((90284425, 'C8593'), 'Rossko', '27.12.2023 07:46:06', 'Биробиджан г, Еврейская Аобл, Комбайностроителей, 38 к 3, Автосервис ЕВРОТЕХ', 'Втулка стабилизатора | перед прав |', 'LYNXauto', '393.00', 1, 2)
]

berg_mock_response = [
    ((903056101, 'LT-1150'), 'BERG', '27.12.2023 13:49:35', 'Биробиджан г, Еврейская Аобл, Комбайностроителей, 38 к 3, Автосервис ЕВРОТЕХ', 'Фильтр АКПП', 'LYNXauto', '3062.00', 1, 2),
    ((90230585, '1520831U0B'), 'BERG', '27.12.2023 11:13:03', 'Биробиджан г, Еврейская Аобл, Комбайностроителей, 38 к 3, Автосервис ЕВРОТЕХ', 'Фильтр масляный', 'Nissan', '631.08', 1, 2),
    ((90284525, 'SI-1061'), 'BERG', '27.12.2023 07:46:06', 'Биробиджан г, Еврейская Аобл, Комбайностроителей, 38 к 3, Автосервис ЕВРОТЕХ', 'Рычаг подвески | зад прав |', 'SUFIX', '2015.00', 1, 2),
    ((96284425, 'C8592'), 'BERG', '27.12.2023 07:46:06', 'Биробиджан г, Еврейская Аобл, Комбайностроителей, 38 к 3, Автосервис ЕВРОТЕХ', 'Втулка стабилизатора | перед лев |', 'LYNXauto', '353.00', 1, 2),
    ((90284425, 'C7293LR'), 'BERG', '27.12.2023 07:46:06', 'Биробиджан г, Еврейская Аобл, Комбайностроителей, 38 к 3, Автосервис ЕВРОТЕХ', 'Стойка стабилизатора | перед прав/лев |', 'LYNXauto', '799.00', 2, 2),
    ((90287425, 'C8593'), 'BERG', '27.12.2023 07:46:06', 'Биробиджан г, Еврейская Аобл, Комбайностроителей, 38 к 3, Автосервис ЕВРОТЕХ', 'Втулка стабилизатора | перед прав |', 'LYNXauto', '393.00', 1, 2)
]


# (uniq_id, supplier, created_date, delivery_address, name, brand, price, count, status)
# ("(90305610, 'LT-1150')", 'Rossko', datetime.datetime(2023, 12, 27, 13, 49, 35), 'Биробиджан г, Еврейская Аобл, Комбайностроителей, 38 к 3, Автосервис ЕВРОТЕХ', 'Фильтр АКПП', 'LYNXauto', '3062.00', 1, 2)